base/Documents/бит_УстановкаКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаКонтрольныхЗначений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>InformationRegister.бит_СрокиКонтроляПоБюджету</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийКонтролируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклонения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОтклоненийКонтрольныхЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклоненияКоличество</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОтклоненийКонтрольныхЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтклоненияКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_ЦФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_БанковскийСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_8</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_8"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_9</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_9"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_10</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_10"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_11</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_11"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_12</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_12"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяПериодичностьКонтроля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыКонтроляПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_РежимыКонтроляПоБюджету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыКонтроляПоБюджету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикиДоговоров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыОтклоненийКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОтклоненийКонтрольныхЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_УстановкаКонтрольныхЗначений/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВосстановитьНастройкиПостроителя(Параметры.ЗначениеКопирования);
		Иначе
			ВосстановитьНастройкиПостроителя(Объект.Ссылка);
		КонецЕсли;
	КонецЕсли; 
		
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	ТекущийВидКонтроля = Объект.ВидКонтроля;
	
	// Отображение разрезов бюджетирования в табличном поле "Настройки заполнения".
	ОтобразитьРазрезыБюджетирования();
		
	УправлениеФормой(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	бит_МеханизмПолученияДанных.УстановитьОформлениеТаблицыОтбор(УсловноеОформление);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьРазрезыБюджетирования();
	
	// Сохранение отбора построителя
	СтруктураНастройки = Новый Структура;
	
	МассивОтбор = Новый Массив;
	Для каждого СтрокаОтбор Из ТаблицаОтбор Цикл
	
		 ЭлементОтбора = бит_МеханизмПолученияДанных.ЭлементОтбора();
		 
		 ЗаполнитьЗначенияСвойств(ЭлементОтбора, СтрокаОтбор);
		 МассивОтбор.Добавить(ЭлементОтбора);
		 
	КонецЦикла; 
	
	СтруктураНастройки.Вставить("Отбор", МассивОтбор);	
	
	ТекущийОбъект.СохранитьНастройкиПостроителя(СтруктураНастройки);

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбратьПериодЗавершение" И Источник = УникальныйИдентификатор Тогда	
		
		РедактированиеПериодаЗавершение(Параметр.Результат, Неопределено);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	
	ВосстановитьНастройкиПостроителя(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		// АПК:1036-выкл Не является синтаксической ошибкой.
		КлючеваяОперация = "Проведениебит_УстановкаКонтрольныхЗначений";
		// АПК:1036-вкл
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
  
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОтклоненияПриИзменении(Элемент)
	
	ИзменениеВидаОтклоненияСервер("ВидОтклонения", "ЗначениеОтклонения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтклоненияКоличествоПриИзменении(Элемент)
	
	ИзменениеВидаОтклоненияСервер("ВидОтклоненияКоличество", "ЗначениеОтклоненияКоличество");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтроляПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидКонтроля) Тогда
		Объект.ВидКонтроля = ТекущийВидКонтроля
	КонецЕсли; 
	
	// Если операция не поменялась, то выходим.
	Если ТекущийВидКонтроля = Объект.ВидКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВидКонтроля = Объект.ВидКонтроля;

	ИзменениеВидаКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольнаяПериодичностьКонтроляПриИзменении(Элемент)
	
	Если Объект.ПроизвольнаяПериодичностьКонтроля Тогда
		ДатаНачалаКонтроля = ?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, Объект.Дата);
		Объект.ДатаНачалаКонтроля	 = ДатаНачалаКонтроля;
		Объект.ДатаОкончанияКонтроля = Объект.ДатаОкончания;		
		Объект.ПериодичностьКонтроля = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.ПустаяСсылка");
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьКонтроляПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаКонтроля) Тогда
		ДатаНачалаКонтроля = ?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, Объект.Дата);
		Объект.ДатаНачалаКонтроля 	 = ДатаНачалаКонтроля;
		Объект.ДатаОкончанияКонтроля = ДатаНачалаКонтроля;
	КонецЕсли;
	УстановитьГраницыКонтроля();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаКонтроляПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаКонтроля > Объект.ДатаОкончанияКонтроля Тогда
		Объект.ДатаОкончанияКонтроля = Объект.ДатаНачалаКонтроля;
	КонецЕсли;
	УстановитьГраницыКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияКонтроляПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаКонтроля > Объект.ДатаОкончанияКонтроля Тогда
		Объект.ДатаНачалаКонтроля = Объект.ДатаОкончанияКонтроля;
	КонецЕсли;
	УстановитьГраницыКонтроля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкаЗаполнения

&НаКлиенте
Процедура НастройкаЗаполненияИспользоватьРазрезПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкаЗаполнения.ТекущиеДанные;
	Объект[ТекущиеДанные.ИмяРеквизита] = ТекущиеДанные.ИспользоватьРазрез; 
	
	НастройкаЗаполненияИспользоватьРазрезПриИзмененииНаСервере(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ИспользоватьРазрез);
	
	Модифицированность = Истина;
	
КонецПроцедуры // НастройкаЗаполненияИспользоватьРазрезПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОтбор

&НаКлиенте
Процедура ТаблицаОтборПриИзменении(Элемент)
	
	ТаблицаОтборКоличество = КоличествоСтрокОтбора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ТаблицаОтборПредставление Тогда
	
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;	
		ТекущиеДанные.Использование  = Истина;  
		ТекущиеДанные.ВидСравнения   = ВидСравнения.Равно;

		СтрПар = Новый Структура("ТекстЗапроса", ТекстЗапросаПоНастройкам);
		бит_ПолучениеДанныхКлиент.ОткрытьФормуПолейПостроителя(ТекущиеДанные, "ТаблицаОтбор", "ПутьКДанным", "Отбор", "", СтрПар);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;
	Если НоваяСтрока И Не Копирование Тогда
		Если Копирование Тогда
			ТекущиеДанные.ПутьКДанным = "";
		Иначе
			ТекущиеДанные.Использование  = Истина;  
			ТекущиеДанные.ВидСравнения   = ВидСравнения.Равно; 
		КонецЕсли; 	

		СтрПар = Новый Структура("ТекстЗапроса", ТекстЗапросаПоНастройкам);
		бит_ПолучениеДанныхКлиент.ОткрытьФормуПолейПостроителя(ТекущиеДанные, "ТаблицаОтбор", "ПутьКДанным", "Отбор", "", СтрПар);
	Иначе
		УстановитьСвойствоВыборГруппИЭлементов(Элементы.ТаблицаОтборЗначение, ТекущиеДанные.ВидСравнения);
	КонецЕсли; 
	
КонецПроцедуры
   
&НаКлиенте
Процедура ТаблицаОтборВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;
		
	СписокВидов = СписокВыбораВидаСравнения(ТекущиеДанные.ПолучитьИдентификатор());

	Элемент.СписокВыбора.Очистить();
	Для каждого Эл Из СписокВидов Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВидСравненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;

	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекущиеДанные.ВидСравнения = ВыбранноеЗначение;
	    ИзменениеВидаСравнения(ТекущиеДанные.ПолучитьИдентификатор());		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;
	ИзменениеВидаСравнения(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;	
	бит_ПолучениеДанныхКлиент.ТаблицаОтборЗначениеНачалоВыбора(ЭтотОбъект, 
		ТекущиеДанные, Элемент, ДанныеВыбора, СтандартнаяОбработка);
                                               	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтборЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОтбор.ТекущиеДанные;	
	бит_ПолучениеДанныхКлиент.ТаблицаОтборЗначениеОчистка(ТекущиеДанные, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура КомандаНастройкиПериода(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры // КомандаНастройкиПериода()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ЗначениеОтклонения.Видимость			= ЗначениеЗаполнено(Объект.ВидОтклонения);
	Элементы.ЗначениеОтклоненияКоличество.Видимость = ЗначениеЗаполнено(Объект.ВидОтклоненияКоличество);
	
	ЭтоКонтрольБюджета  = Объект.ВидКонтроля = ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет");
	ЭтоКонтрольЗаявок   = Объект.ВидКонтроля = ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Заявки");
	ЭтоКонтрольГрафиков = Объект.ВидКонтроля = ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.ГрафикиДоговоров");
	
	Элементы.СценарийКонтролируемый.Видимость  = ЭтоКонтрольБюджета;
	
	Элементы.ПериодичностьКонтроля.Видимость = Объект.ПроизвольнаяПериодичностьКонтроля;
	Элементы.ГруппаПериодКонтроля.Видимость  = Объект.ПроизвольнаяПериодичностьКонтроля 
		И НЕ ЗначениеЗаполнено(Объект.ПериодичностьКонтроля);
	
КонецПроцедуры
 
&НаСервере
Процедура ВосстановитьНастройкиПостроителя(ТекущийОбъект)
	
	РеквизитыДокумента = Документы.бит_УстановкаКонтрольныхЗначений.РеквизитыДокумента(ТекущийОбъект);
	Если РеквизитыДокумента.Количество() = 0 Тогда
		РеквизитыДокумента.Добавить();
		РеквизитыДокумента[0].ХранилищеНастроекОтбора = Новый ХранилищеЗначения(Неопределено);
		НастройкиОтбора = Неопределено;
	Иначе
		НастройкиОтбора = РеквизитыДокумента[0].ХранилищеНастроекОтбора.Получить();
	КонецЕсли;
	
	Построитель = Новый ПостроительОтчета;	
	Документы.бит_УстановкаКонтрольныхЗначений.ИнициализироватьПостроительОтчета(Построитель, РеквизитыДокумента[0]);
	
	ТекстЗапроса			 = Построитель.Текст;
	ТекстЗапросаПоНастройкам = ТекстЗапросаПоНастройкам(ТекстЗапроса);
	
	Если НастройкиОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоСтарыйВариантНастроек = ТипЗнч(НастройкиОтбора) = Тип("НастройкиПостроителяОтчета");
	Если Не ЭтоСтарыйВариантНастроек И Не (ТипЗнч(НастройкиОтбора) = Тип("Структура")) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОтбор.Очистить();
	
	// Старый формат хранения настроек - для совместимости версий.
	Если ЭтоСтарыйВариантНастроек Тогда
		Построитель.УстановитьНастройки(НастройкиОтбора, Истина, Ложь, Истина, Истина);
		Для каждого ЭО Из Построитель.Отбор Цикл
			СтрокаОтбор = ТаблицаОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОтбор, ЭО);
		КонецЦикла; 
	Иначе
		Если НастройкиОтбора.Свойство("Отбор") Тогда
			Для каждого ЭлементОтбора Из НастройкиОтбора.Отбор Цикл
				СтрокаОтбор = ТаблицаОтбор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОтбор, ЭлементОтбора);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
	ТаблицаОтборКоличество = КоличествоСтрокОтбора(ЭтотОбъект);
	ВосстановитьНастройкиПостроителяСообщитьОбОшибках();
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеВидаКонтроля()
	
	Если Объект.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки
		ИЛИ Объект.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.ГрафикиДоговоров Тогда
	
		Объект.СценарийКонтролируемый = Справочники[бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования()].ПустаяСсылка();
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ИзменениеВидаОтклоненияСервер(Знач ИмяВидаОтклонения, Знач ИмяЗначенияОтклонения) 

	Если Объект[ИмяВидаОтклонения] = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Абсолютное Тогда
		
		Если ИмяВидаОтклонения = "ВидОтклоненияКоличество" Тогда
			ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Любой);
		Иначе	
			ОписаниеТипаЧисло = РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Любой);
		КонецЕсли; 
		
		Элементы[ИмяЗначенияОтклонения].ОграничениеТипа = ОписаниеТипаЧисло;
		Объект[ИмяЗначенияОтклонения] = ОписаниеТипаЧисло.ПривестиЗначение(Объект.ЗначениеОтклонения);
		
	ИначеЕсли Объект[ИмяВидаОтклонения] = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Процент Тогда
		
		ОписаниеТипаЧисло = РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Любой);
		
		Элементы[ИмяЗначенияОтклонения].ОграничениеТипа = ОписаниеТипаЧисло;
		Объект[ИмяЗначенияОтклонения] = ОписаниеТипаЧисло.ПривестиЗначение(Объект.ЗначениеОтклонения);
		
		Если Объект[ИмяЗначенияОтклонения] > 100 Тогда
			Объект[ИмяЗначенияОтклонения] = 100;
		ИначеЕсли Объект[ИмяЗначенияОтклонения] < -100 Тогда
			Объект[ИмяЗначенияОтклонения] = -100;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект[ИмяВидаОтклонения]) Тогда
		Объект[ИмяЗначенияОтклонения] = 0;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ИзменениеВидаСравнения(Знач ИдСтроки)
	
	ТекущиеДанные = ТаблицаОтбор.НайтиПоИдентификатору(ИдСтроки); 	
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);
	УстановитьСвойствоВыборГруппИЭлементов(Элементы.ТаблицаОтборЗначение, ТекущиеДанные.ВидСравнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойствоВыборГруппИЭлементов(Элемент, ВидСравнения)

	Если ВидСравнения = ПредопределенноеЗначение("ВидСравнения.ВИерархии") 
		ИЛИ ВидСравнения = ПредопределенноеЗначение("ВидСравнения.НеВИерархии")
		ИЛИ ВидСравнения = ПредопределенноеЗначение("ВидСравнения.ВСпискеПоИерархии")
		ИЛИ ВидСравнения = ПредопределенноеЗначение("ВидСравнения.НеВСпискеПоИерархии") Тогда
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе	
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СписокВыбораВидаСравнения(Знач ИдСтроки)
	
	ТекущиеДанные = ТаблицаОтбор.НайтиПоИдентификатору(ИдСтроки);
	СписокВидов = бит_МеханизмПолученияДанных.СписокВыбораВидаСравнения(ТекущиеДанные);
	
    Возврат СписокВидов;
	
КонецФункции
        
&НаСервере 
Процедура ОтобразитьРазрезыБюджетирования()

	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("Сценарий");
	МассивИсключений.Добавить("СтатьяОборотов");
	
	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все", "синоним", , МассивИсключений);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Для каждого КлючИЗначение Из Измерения Цикл
		
		ИмяРеквизита = "НЗ_" + КлючИЗначение.Ключ;
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаданныеОбъекта) Тогда
			
			НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
			
			ТекущаяНастройка = НастройкиИзмерений[КлючИЗначение.Ключ];
			Если Найти(ВРег(КлючИЗначение.Ключ), "АНАЛИТИКА") > 0 Тогда
				Если НЕ ТекущаяНастройка = Неопределено Тогда
					НоваяСтрока                    = НастройкаЗаполнения.Добавить();
					НоваяСтрока.ИмяРеквизита       = ИмяРеквизита;
					НоваяСтрока.ИспользоватьРазрез = Объект[ИмяРеквизита];
					НоваяСтрока.Измерение          = ТекущаяНастройка.Синоним;
				КонецЕсли; 				
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока                    = НастройкаЗаполнения.Добавить();
			НоваяСтрока.ИмяРеквизита       = ИмяРеквизита;
			НоваяСтрока.ИспользоватьРазрез = Объект[ИмяРеквизита];
			НоваяСтрока.Измерение          = КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура УстановитьРазрезыБюджетирования()
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Для каждого СтрокаТаблицы Из НастройкаЗаполнения Цикл
		ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаданныеОбъекта) Тогда
			Если Объект[ИмяРеквизита] <> СтрокаТаблицы.ИспользоватьРазрез Тогда
				Объект[ИмяРеквизита] = СтрокаТаблицы.ИспользоватьРазрез;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте 
Процедура РедактированиеПериодаЗавершение(ПериодРезультат, ДополнительныеДанные)

	Если ПериодРезультат <> Неопределено Тогда
	
		Объект.ДатаНачала    = ПериодРезультат.ДатаНачала;
		Объект.ДатаОкончания = ПериодРезультат.ДатаОкончания;
		
		ЭтотОбъект.Модифицированность = Истина; 		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Если ТаблицаОтбор.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	НастройкиДопИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	НастройкиОснИзмерений = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все"  , "Синоним");
	
	Для каждого СтрокаТаблицы Из ТаблицаОтбор Цикл
		ЭлементыПути = СтрРазделить(СтрокаТаблицы.ПутьКДанным, ".");
		Если ЭлементыПути.Количество() > 1 Тогда
			Измерение = ЭлементыПути[0];
			ЭлементыПути.Удалить(0);
			СвойстваИзмерения = "." + СтрСоединить(ЭлементыПути, ".");
		Иначе	
			Измерение 		  = СтрокаТаблицы.ПутьКДанным;
			СвойстваИзмерения = "";
		КонецЕсли; 
		
		ОписаниеИзмерения = НастройкиДопИзмерений.Получить(Измерение);
		Если ОписаниеИзмерения <> Неопределено Тогда
			СтрокаТаблицы.Представление = ОписаниеИзмерения.Синоним;
		Иначе
			Если НастройкиОснИзмерений.Свойство(Измерение, ОписаниеИзмерения) Тогда
				СтрокаТаблицы.Представление = ОписаниеИзмерения;
			КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ ПустаяСтрока(СтрокаТаблицы.Представление) Тогда
			СтрокаТаблицы.Представление = СтрокаТаблицы.Представление + СвойстваИзмерения;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоСтрокОтбора(Форма)

	Возврат Форма.ТаблицаОтбор.Количество();

КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГраницыКонтроля()

	Объект.ДатаНачалаКонтроля = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(
									Объект.ДатаНачалаКонтроля, Объект.ПериодичностьКонтроля);
									
	Объект.ДатаОкончанияКонтроля = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(
									Объект.ДатаОкончанияКонтроля, Объект.ПериодичностьКонтроля);								
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкаЗаполненияИзмерение");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НастройкаЗаполнения.ИспользоватьРазрез", ВидСравненияКомпоновкиДанных.Равно, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ФонПодписьВерна);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкаЗаполненияИзмерение");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НастройкаЗаполнения.ИмяРеквизита", ВидСравненияКомпоновкиДанных.Равно, "НЗ_БанковскийСчет");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидКонтроля", ВидСравненияКомпоновкиДанных.НеРавно, 
		Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", 	ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоНастройкам(ТекстЗапросаШаблон)
	
	РеквизитыДокумента = ""
	+ "НЗ_Аналитика_1,"
	+ "НЗ_Аналитика_2,"
	+ "НЗ_Аналитика_3,"
	+ "НЗ_Аналитика_4,"
	+ "НЗ_Аналитика_5,"
	+ "НЗ_Аналитика_6,"
	+ "НЗ_Аналитика_7,"
	// ++ ЕРП 
	+ "НЗ_Аналитика_8,"
	+ "НЗ_Аналитика_9,"
	+ "НЗ_Аналитика_10,"
	+ "НЗ_Аналитика_11,"
	+ "НЗ_Аналитика_12";
	// -- ЕРП 
	
	РеквизитыДокумента = Новый Структура(РеквизитыДокумента); 
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Объект);
	
	ТекстЗапросаПоНастройкам = "";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(СтрЗаменить(ТекстЗапросаШаблон, "{&Периодичность}", ""));
	Отборы = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыраженияОтбораКомпоновкиДанных;
	
	Для каждого Реквизит Из РеквизитыДокумента Цикл
		Если НЕ Реквизит.Значение Тогда
			Поле   = СтрЗаменить(Реквизит.Ключ, "НЗ_", "");
			Индекс = -1;
			Если СтрНачинаетсяС(Поле, "Аналитика_") Тогда
				Для каждого Отбор Из Отборы Цикл
					Если Отбор.Псевдоним = Поле Тогда
						Индекс = Отборы.Индекс(Отбор);
					КонецЕсли;
				КонецЦикла; 
			Иначе	
				Отбор  = Отборы.Найти(СтрШаблон("бит_ОборотыПоБюджетам.%1", СтрЗаменить(Реквизит.Ключ, "НЗ_", "")));
				Если Отбор <> Неопределено Тогда
					Индекс = Отборы.Индекс(Отбор);
				КонецЕсли;
			КонецЕсли;
			Если Индекс >= 0 Тогда
				Отборы.Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	ТекстЗапросаПоНастройкам = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапросаПоНастройкам;
	
КонецФункции

&НаСервере
Процедура НастройкаЗаполненияИспользоватьРазрезПриИзмененииНаСервере(Знач ИмяРеквизита, Знач Использование)

	Если НЕ Использование Тогда
		Поле   = СтрЗаменить(ИмяРеквизита, "НЗ_", "");
		Индекс = ТаблицаОтбор.Количество() - 1;
		Пока Индекс >= 0 Цикл
			СтрокаТаблицы = ТаблицаОтбор.Получить(Индекс);
			ЧастиПути 	  = СтрРазделить(СтрокаТаблицы.ПутьКДанным,".");
			ПутьКДанным   = "";
			Если ЧастиПути.Количество() >= 1 Тогда
				ПутьКДанным = ЧастиПути[0];
			КонецЕсли;
			Если ПутьКДанным = Поле Тогда
				ТаблицаОтбор.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла; 
	КонецЕсли;
	
	ТекстЗапросаПоНастройкам = ТекстЗапросаПоНастройкам(ТекстЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПостроителяСообщитьОбОшибках()

	Индекс = 0;
	Для каждого СтрокаТаблицы Из ТаблицаОтбор Цикл
		ЧастиПути 	= СтрРазделить(СтрокаТаблицы.ПутьКДанным,".");
		ПутьКДанным = "";
		Если ЧастиПути.Количество() >= 1 Тогда
			ПутьКДанным = ЧастиПути[0];
		КонецЕсли;
		ПолеДанных 	   = "НЗ_" + ПутьКДанным;
		ЕстьПолеДанных = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ПолеДанных);
		Если ЕстьПолеДанных И СтрокаТаблицы.Использование И НЕ Объект[ПолеДанных] Тогда
			ТекстПояснения = НСтр("ru = 'Отбор устанавливается только на измерения контроля';
								| en = 'The selection is set only for the management order'"); 
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"Колонка","КОРРЕКТНОСТЬ", НСтр("ru = 'Поле'; en = 'Fild'"), Индекс + 1,
								НСтр("ru = 'Отборы'; en = 'Selections'") , ТекстПояснения);
								
			Поле = СтрШаблон("ТаблицаОтбор[%1].Представление", Формат(Индекс, "ЧН=0; ЧГ="));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле, , Ложь);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;

КонецПроцедуры
 
#КонецОбласти
